Repository: LeePepe/VitalStride
Catalog: VitalStride/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 第 %lld 组次数
source: Set %lld reps
zh_hans: 第 %lld 组次数

# 第 %lld 组设置
source: Set %lld options
zh_hans: 第 %lld 组设置

# 第 %lld 组重量
source: Set %lld weight
zh_hans: 第 %lld 组重量

# 管理 HealthKit 权限
source: Manage HealthKit permissions
zh_hans: 管理 HealthKit 权限

# 约 %lld 分钟
source: ~%lld min
zh_hans: 约 %lld 分钟

# 组
source: sets
zh_hans: 组

# 组数进度
source: Set progress
zh_hans: 组数进度

# 组类型
source: Set type
zh_hans: 组类型

# 结束训练
source: Finish workout
zh_hans: 结束训练

# 继续训练
source: Continue workout
zh_hans: 继续训练

# 缩短十秒
source: Shorten 10 seconds
zh_hans: 缩短十秒

# 肩
source: Shoulders
zh_hans: 肩

# 背
source: Back
zh_hans: 背

# 胸
source: Chest
zh_hans: 胸

# 能量
source: Energy
zh_hans: 能量

# 脂肪
source: Fat
zh_hans: 脂肪

# 腿
source: Legs
zh_hans: 腿

# 膳食能量摄入
source: Dietary Energy
zh_hans: 膳食能量摄入

# 臂
source: Arms
zh_hans: 臂

# 致谢
source: Acknowledgements
zh_hans: 致谢

# 舞蹈
source: Dance
zh_hans: 舞蹈

# 英里
source: mi
zh_hans: 英里

# 营养
source: Nutrition
zh_hans: 营养

# 蛋白质
source: Protein
zh_hans: 蛋白质

# 训练
source: Workouts
zh_hans: 训练

# 训练 — Coming Soon
source: Workouts — Coming Soon
zh_hans: 训练 — Coming Soon

# 训练中
source: In workout
zh_hans: 训练中

# 训练将被保存到历史记录
source: The workout will be saved to history
zh_hans: 训练将被保存到历史记录

# 训练数据将不会保存
source: The workout data will not be saved
zh_hans: 训练数据将不会保存

# 训练时长
source: Workout duration
zh_hans: 训练时长

# 训练详情
source: Workout details
zh_hans: 训练详情

# 训练趋势
source: Workout trends
zh_hans: 训练趋势

# 设置
source: Settings
zh_hans: 设置

# 设置 — Coming Soon
source: Settings — Coming Soon
zh_hans: 设置 — Coming Soon

# 评估恢复状态与建议
source: Assess recovery status and advice
zh_hans: 评估恢复状态与建议

# 该动作及所有已录入的组数据将被删除
source: This exercise and all recorded sets will be deleted
zh_hans: 该动作及所有已录入的组数据将被删除

# 请先导入预置动作库
source: Please import the preset exercise library first
zh_hans: 请先导入预置动作库

# 请前往设置页面授权访问健康数据，授权后即可查看心率、步数等数据。
source: Please go to Settings to authorize health-data access; once authorized you can view heart rate, steps, and other data.
zh_hans: 请前往设置页面授权访问健康数据，授权后即可查看心率、步数等数据。

# 请在侧边栏「设置」中授权访问健康数据，授权后即可查看心率、步数等数据。
source: Authorize access to health data in the Settings sidebar to view heart rate, step count, and more.
zh_hans: 请在侧边栏「设置」中授权访问健康数据，授权后即可查看心率、步数等数据。

# 请求授权
source: Request authorization
zh_hans: 请求授权

# 请求的数据类型
source: Requested data types
zh_hans: 请求的数据类型

# 趋势
source: Trend
zh_hans: 趋势

# 趋势分析
source: Trend Analysis
zh_hans: 趋势分析

# 跑步
source: Running
zh_hans: 跑步

# 距离
source: Distance
zh_hans: 距离

# 距离 %@
source: Distance %@
zh_hans: 距离 %@

# 跳过
source: Skip
zh_hans: 跳过

# 跳过休息
source: Skip rest
zh_hans: 跳过休息

# 身体测量
source: Body measurements
zh_hans: 身体测量

# 身高
source: Height
zh_hans: 身高

# 轻点两下以展开
source: Double-tap to expand
zh_hans: 轻点两下以展开

# 轻点两下以折叠
source: Double-tap to collapse
zh_hans: 轻点两下以折叠

# 轻点查看详情
source: Tap to view details
zh_hans: 轻点查看详情

# 输入 API Key
source: Enter API key
zh_hans: 输入 API Key

# 输入你的问题...
source: Enter your question...
zh_hans: 输入你的问题...

# 输入右侧重量数值
source: Enter right-side weight
zh_hans: 输入右侧重量数值

# 输入左侧重量数值
source: Enter left-side weight
zh_hans: 输入左侧重量数值

# 输入次数
source: Enter reps
zh_hans: 输入次数

# 输入重量数值
source: Enter weight
zh_hans: 输入重量数值

# 运动
source: Workouts
zh_hans: 运动

# 运动记录
source: Workout History
zh_hans: 运动记录

# 连接健康数据
source: Connect health data
zh_hans: 连接健康数据

# 选中%@，总睡眠%@，深睡%@，浅睡%@，REM %@，清醒%@
source: 选中%1$@，总睡眠%2$@，深睡%3$@，浅睡%4$@，REM %5$@，清醒%6$@
zh_hans: 选中%@，总睡眠%@，深睡%@，浅睡%@，REM %@，清醒%@

# 选中体重 %@ %@，%@
source: 选中体重 %1$@ %2$@，%3$@
zh_hans: 选中体重 %@ %@，%@

# 选中心率 %lld BPM，%@
source: 选中心率 %1$lld BPM，%2$@
zh_hans: 选中心率 %lld BPM，%@

# 选择动作
source: Choose exercise
zh_hans: 选择动作

# 选择时间范围
source: Select Time Range
zh_hans: 选择时间范围

# 重新分析
source: Re-analyze
zh_hans: 重新分析

# 重试
source: Retry
zh_hans: 重试

# 重试 AI 分析
source: Retry AI analysis
zh_hans: 重试 AI 分析

# 重试发送消息
source: Retry sending message
zh_hans: 重试发送消息

# 重试生成训练建议
source: Retry generating workout advice
zh_hans: 重试生成训练建议

# 重量
source: Weight
zh_hans: 重量

# 锻炼时间
source: Exercise Time
zh_hans: 锻炼时间

# 长按可替换或删除动作
source: Long-press to replace or delete exercise
zh_hans: 长按可替换或删除动作

# 阶段
source: Stage
zh_hans: 阶段

# 隐私告知
source: Privacy Notice
zh_hans: 隐私告知

# 需要 HealthKit 授权
source: HealthKit authorization required
zh_hans: 需要 HealthKit 授权

# 需要配置 API Key
source: API key required
zh_hans: 需要配置 API Key

# 静息心率
source: Resting Heart Rate
zh_hans: 静息心率

# 饮水量
source: Water
zh_hans: 饮水量

# 骑行
source: Cycling
zh_hans: 骑行

# 骑行距离
source: Cycling Distance
zh_hans: 骑行距离

# onboarding_next_button
source: Next
zh_hans: 下一步

# workout_save_as_template
source: Save as Template
zh_hans: 保存为模板

# workout_template_default_name_suffix
source: Workout
zh_hans: 训练

# workout_template_name_message
source: Give this template a name so you can reuse it later.
zh_hans: 为这个模板起个名字，下次训练可直接套用。

# workout_template_name_placeholder
source: Template name
zh_hans: 模板名称

# workout_template_name_prompt
source: Template Name
zh_hans: 模板名称

# workout_template_save_confirm
source: Save
zh_hans: 保存

# workout_template_save_failed_message
source: Unable to save this workout as a template. Please try again.
zh_hans: 无法保存为模板，请稍后重试。

# workout_template_save_failed_title
source: Save Failed
zh_hans: 保存失败

# workout_template_saved_message
source: You can start a new workout from this template on the Start Workout screen.
zh_hans: 下次在“开始训练”页可直接从此模板开始。

# workout_template_saved_title
source: Template Saved
zh_hans: 模板已保存

# active_workout.smart_progression.chip_format
source: Suggested %1$@ × %2$lld
zh_hans: 建议 %1$@ × %2$lld

# active_workout.smart_progression.chip_a11y_hint
source: Double-tap to fill weight and reps with the suggestion.
zh_hans: 双击将建议的重量与次数填入输入框。

# smart_progression.reason.increase_weight
source: All sets hit target — increase weight
zh_hans: 上次所有组都达标——建议加重

# smart_progression.reason.decrease_weight
source: Below lower bound — decrease weight
zh_hans: 上次均未达下限——建议减重

# smart_progression.reason.maintain_dropoff
source: Last set dropped — maintain
zh_hans: 最后一组掉次数——建议保持

# smart_progression.reason.maintain_inrange
source: Within range — maintain
zh_hans: 落在目标区间——建议保持

# smart_progression.reason.increase_reps
source: Within range — push reps
zh_hans: 落在目标区间——建议加次数

# workout_list_view_mode_list
source: List
zh_hans: 列表

# workout_list_view_mode_calendar
source: Calendar
zh_hans: 日历

# workout_calendar_previous_month
source: Previous month
zh_hans: 上个月

# workout_calendar_next_month
source: Next month
zh_hans: 下个月

# workout_calendar_weekday_sun
source: Sun
zh_hans: 日

# workout_calendar_weekday_mon
source: Mon
zh_hans: 一

# workout_calendar_weekday_tue
source: Tue
zh_hans: 二

# workout_calendar_weekday_wed
source: Wed
zh_hans: 三

# workout_calendar_weekday_thu
source: Thu
zh_hans: 四

# workout_calendar_weekday_fri
source: Fri
zh_hans: 五

# workout_calendar_weekday_sat
source: Sat
zh_hans: 六

# workout_calendar_date_a11y_format
source: %1$@, %lld workouts
zh_hans: %1$@，%lld 次训练

# workout_calendar_date_a11y_no_workout_format
source: %@, no workouts
zh_hans: %@，无训练

# workout_list_load_more
source: Load more
zh_hans: 加载更多

# workout_keyboard.add_drop_set_a11y
source: Add drop-set sub-set
zh_hans: 添加递减子组

# workout_keyboard.add_pyramid_a11y
source: Add ascending sub-set
zh_hans: 添加递增子组

# workout_keyboard.copy_label
source: Copy
zh_hans: 复制

# workout_keyboard.copy_to_next_a11y
source: Copy values to next set
zh_hans: 复制到下一组

# workout_keyboard.disabled_hint
source: This key is unavailable for the current set type
zh_hans: 当前组类型下此键不可用

# workout_keyboard.done_a11y
source: Finish input
zh_hans: 完成输入

# workout_keyboard.done_label
source: Done
zh_hans: 完成

# workout_keyboard.preset_high_a11y
source: 15 to 20 reps preset
zh_hans: 15 到 20 次预设

# workout_keyboard.preset_low_a11y
source: 4 to 6 reps preset
zh_hans: 4 到 6 次预设

# workout_keyboard.preset_mid_a11y
source: 8 to 12 reps preset
zh_hans: 8 到 12 次预设

# workout_keyboard.toggle_unilateral_a11y
source: Toggle unilateral or bilateral input
zh_hans: 切换单侧或合计输入

# workout_keyboard.toggle_unilateral_label
source: Uni/Total
zh_hans: 单侧/合计

# workout_list_load_more_a11y
source: Load more workouts
zh_hans: 加载更多训练

# health_detail.window.previous
source: Previous window
zh_hans: 上一段

# health_detail.window.next
source: Next window
zh_hans: 下一段

# health_detail.window.range_a11y %@
source: Current range %@
zh_hans: 当前范围 %@

# settings.watchScreen.title
source: Watch Workout Screen
zh_hans: 手表训练屏

# settings.watchScreen.preset
source: Layout
zh_hans: 布局

# settings.watchScreen.preset.fullInfo
source: Full Info
zh_hans: 全信息

# settings.watchScreen.preset.hrFocus
source: HR Focus
zh_hans: 心率优先

# settings.watchScreen.preset.list
source: List
zh_hans: 列表

# settings.watchScreen.preset.nextFocus
source: Next Set Focus
zh_hans: 下一组优先

# settings.watchScreen.modules
source: Modules
zh_hans: 显示模块

# settings.watchScreen.locked
source: Required
zh_hans: 必选

# settings.watchScreen.module.clock
source: Time
zh_hans: 时间

# settings.watchScreen.module.elapsed
source: Elapsed
zh_hans: 训练时长

# settings.watchScreen.module.setsTotal
source: Total Sets
zh_hans: 总组数

# settings.watchScreen.module.heartRate
source: Heart Rate
zh_hans: 心率

# settings.watchScreen.module.hrZone
source: HR Zone
zh_hans: 心率区间

# settings.watchScreen.module.hrAvgPeak
source: Avg / Peak HR
zh_hans: 均值/峰值心率

# settings.watchScreen.module.nextSet
source: Next Set
zh_hans: 下一组

# settings.watchScreen.module.setDots
source: Set Progress
zh_hans: 组进度

# settings.watchScreen.module.primaryAction
source: Primary Action
zh_hans: 主操作

# watch.hr.notConnected
source: Not connected
zh_hans: 未连接

# watch.hr.connecting
source: Connecting
zh_hans: 连接中

# watch.hr.hint.start
source: Start a workout to connect HR
zh_hans: 开始训练以连接心率

# watch.hr.avgPeak
source: avg %lld · peak %lld
zh_hans: 均 %lld · 峰 %lld

# watch.hr.avgPeakPlaceholder
source: avg %@ · peak %@
zh_hans: 均 %@ · 峰 %@

# watch.nextSet.label
source: Next set
zh_hans: 下一组

# watch.nextSet.freeform
source: Freeform
zh_hans: 自由训练

# watch.nextSet.noplan
source: No planned session
zh_hans: 无预定计划

# watch.nextSet.last
source: Last set 💪
zh_hans: 最后一组 💪

# watch.nextSet.progress
source: Set %lld of %lld
zh_hans: 第 %lld / %lld 组

# watch.set.format
source: %lld reps × %@
zh_hans: %lld次 × %@

# watch.set.reps.unit
source: reps
zh_hans: 次

# watch.list.hr
source: HR
zh_hans: 心率

# watch.list.nextSet
source: Next
zh_hans: 下一组

# watch.list.duration
source: Duration
zh_hans: 时长

# watch.list.avgPeak
source: Avg / Peak
zh_hans: 均/峰

# watch.action.completeSet
source: Complete set
zh_hans: 完成这组

# watch.action.logSet
source: Log set
zh_hans: 记录一组

# watch.action.finish
source: Finish workout
zh_hans: 完成训练

# watch.controls.pause
source: Pause
zh_hans: 暂停

# watch.controls.end
source: End workout
zh_hans: 结束训练

# watch.saving
source: Saving workout…
zh_hans: 保存训练…

# watch.a11y.setsProgress
source: Sets progress
zh_hans: 组数进度

# watch.a11y.setDots
source: Set dots
zh_hans: 组进度

# workout_list.source_badge.app
source: App
zh_hans: 本应用

# workout_list.source_badge.app_a11y
source: Recorded in VitalStride
zh_hans: 在 VitalStride 中记录

# workout_list.source_badge.apple_watch_a11y
source: Recorded on Apple Watch
zh_hans: 来自 Apple Watch

# workout_list.source_badge.iphone_a11y
source: Recorded on iPhone
zh_hans: 来自 iPhone

# workout_list.source_badge.ipad_a11y
source: Recorded on iPad
zh_hans: 来自 iPad

# workout_list.source_badge.mac_a11y
source: Recorded on Mac
zh_hans: 来自 Mac

# workout_list.source_badge.healthkit_a11y
source: Recorded via HealthKit
zh_hans: 来自 HealthKit

# workout_list.source_badge.named_source_a11y
source: Source: %@
zh_hans: 来源：%@

# workout_list.row.avg_hr_a11y
source: Average heart rate %lld
zh_hans: 平均心率 %lld

# workout_list.row.exercise_count_a11y
source: %lld exercises
zh_hans: %lld 个动作

# workout_list.row.duration_minutes_a11y
source: %lld minutes
zh_hans: %lld 分钟

# workout_list.preview.nav_title
source: Workouts
zh_hans: 训练

# workout_list.preview.fixture_app_title
source: VitalStride workout
zh_hans: VitalStride 训练

# workout_list.preview.fixture_app_subtitle
source: 6 exercises · 42 min
zh_hans: 6 个动作 · 42 分钟

# workout_list.preview.empty_title
source: No workouts yet
zh_hans: 暂无训练记录

# workout_list.preview.empty_subtitle
source: Tap + to start your first workout
zh_hans: 点击 + 开始第一次训练

# workout_list.state_banner.loading_title
source: Loading workouts
zh_hans: 正在加载训练

# workout_list.state_banner.loading_subtitle
source: Fetching your Apple Watch and Health data.
zh_hans: 正在获取 Apple Watch 与 健康数据。

# workout_list.state_banner.failed_title
source: Couldn't load Apple Health workouts
zh_hans: 无法加载 Apple 健康训练

# workout_list.state_banner.failed_subtitle
source: Pull to refresh, or try again later.
zh_hans: 下拉刷新，或稍后重试。

# workout_list.state_banner.unauthorized_title
source: Grant HealthKit access
zh_hans: 开启 HealthKit 授权

# workout_list.state_banner.unauthorized_subtitle
source: Enable Workouts in Settings to see Apple Watch training here.
zh_hans: 在系统设置中开启训练权限，即可看到 Apple Watch 训练。

# workout_list.state_banner.open_settings
source: Open Settings
zh_hans: 打开设置

# workout_list.state_banner.open_settings_a11y
source: Open Settings
zh_hans: 打开系统设置

# workout_list.state_banner.open_settings_hint
source: Grants VitalStride access to HealthKit workouts
zh_hans: 允许 VitalStride 读取 HealthKit 训练

# workout_list.unified_section_header
source: Workouts
zh_hans: 训练记录
